import datetime
# Задание №1.
#1.1. Добавляет 15 к заданному числу, переданному в качестве аргумента
# a=lambda x:x+15
# print(a(int(input())))
#1.2. Умножает аргумент х на аргумент у, выведите результат
# b=lambda x,y:x*y
# print(b(int(input()),int(input())))
#1.3. Фильтрует список целых чисел, заданных пользователем
# array = map(int,input().split())
# filtered_array = list(filter(lambda x: x % 1 == 0, array))
# print(filtered_array)
# filtered_array_even = list(filter(lambda x: x % 2 == 0, array))
# print(filtered_array_even)
# filtered_array_odd = list(filter(lambda x: x % 2 == 1, array))
# print(filtered_array_odd)
#1.4. Выводит год,месяц,дату и время.
# year_month_date_time = datetime.datetime.now()
# year = year_month_date_time.year
# month = year_month_date_time.month
# day = year_month_date_time.day
# time = year_month_date_time.time()
# print(year_month_date_time)
# print(year)
# print(month)
# print(day)
# print(time)

#Задание №2.
# a=lambda x,y :x * y
# print(a(int(input()), int(input())))

#Задание №3.
# a = map(int,input("Список целых чисел").split())
# def odd():
#     return f"Количество нечетных чисел {sum(map(lambda x: ((x)%2!=0), (a)))}"
# def even():
#     return f"Количество четных чисел {sum(map(lambda x: ((x)%2==0), (a)))}"
# print(odd())
# print(even())

#Задание №1.